class Solution(object):
    def climbStairs(self, n):
        """
        :type n: int
        :rtype: int
        """
        
        # Если ступеней 1 или 2, количество способов равно n
        if n <= 2:
            return n
        
        # a количество способов для предыдущей ступени
        # b количество способов для текущей ступени
        a, b = 1, 2
        
        # Вычисляем количество способов для каждой следующей ступени
        for i in range(3, n + 1):
            a, b = b, a + b
        
        # Возвращаем количество способов для n ступеней
        return b